{"id": "COPB51H3S20201", "code": "COPB51H3S", "name": "Preparing to Complete your Co-op Work Term", "description": "This course builds on the foundational job search concepts introduced in COPD01H3, providing opportunities to refine application strategies and practice interviewing in various formats, based on academic program areas as well as industry hiring practices. Students begin to experience the Co-op job search cycle by reviewing, selecting, and applying to job postings weekly and receiving feedback similar to when participating in a job search cycle. With this feedback, and the support of your Coordinator, students make adjustments to their job search approach and develop strategies for success in the following term for both job applications and interview performance. The importance of a job search network and research to tailor and prepare during your job search are also examined. This course is a compulsory requirement for the Arts and Science Co-op programs. Students need to pass the course before proceeding to seek for a Co-op work term, therefore, this course may be repeated.", "division": "University of Toronto Scarborough", "department": "Dept. of Physical & Environmental Sci (UTSC)", "prerequisites": "COPB50H3/(COPD01H3); restricted to students in the Arts and Science Co-op programs.", "exclusions": "(COPD03H3)", "level": 200, "campus": "UTSC", "term": "2020 Winter", "breadths": [], "meeting_sections": [{"code": "L01", "instructors": ["M Vanloo-Mve C Jairam"], "times": [{"day": "FRIDAY", "start": 54000, "end": 61200, "duration": 7200, "location": "IC 204"}], "size": 60, "enrolment": 45}, {"code": "L02", "instructors": ["C Jairam C Kwok"], "times": [{"day": "FRIDAY", "start": 54000, "end": 61200, "duration": 7200, "location": "IC 200"}], "size": 60, "enrolment": 50}, {"code": "L31", "instructors": ["V Niles C Jairam"], "times": [{"day": "WEDNESDAY", "start": 61200, "end": 68400, "duration": 7200, "location": "HL B101"}], "size": 180, "enrolment": 104}, {"code": "L32", "instructors": ["S Klassen C Jairam"], "times": [{"day": "MONDAY", "start": 61200, "end": 68400, "duration": 7200, "location": "IC 230"}], "size": 50, "enrolment": 35}]}