{"id": "MAT437H1S20201", "code": "MAT437H1S", "name": "K-Theory and C* Algebras", "description": "The theory of operator algebras was begun by John von Neumann eighty years ago. In one of the most important innovations of this theory, von Neumann and Murray introduced a notion of equivalence of projections in a self-adjoint algebra (*-algebra) of Hilbert space operators that was compatible with addition of orthogonal projections (also in matrix algebras over the algebra), and so gave rise to an abelian semigroup, now referred to as the Murray-von Neumann semigroup. Later, Grothendieck in geometry, Atiyah and Hirzebruch in topology, and Serre in the setting of arbitrary rings (pertinent for instance for number theory), considered similar constructions. The enveloping group of the semigroup considered in each of these settings is now referred to as the K-group (Grothendieck's terminology), or as the Grothendieck group. Among the many indications of the depth of this construction was the discovery of Atiyah and Hirzebruch that Bott periodicity could be expressed in a simple way using the K-group. Also, Atiyah and Singer famously showed that K-theory was important in connection with the Fredholm index. Partly because of these developments, K-theory very soon became important again in the theory of operator algebras. (And in turn, operator algebras became increasingly important in other branches of mathematics.) The purpose of this course is to give a general, elementary, introduction to the ideas of K-theory in the operator algebra context. (Very briefly, K-theory generalizes the notion of dimension of a vector space.) The course will begin with a description of the method (K-theoretical in spirit) used by Murray and von Neumann to give a rough initial classification of von Neumann algebras (into types I, II, and III). It will centre around the relatively recent use of K-theory to study Bratteli's approximately finite-dimensional C*-algebras---both to classify them (a result that can be formulated and proved purely algebraically), and to prove that the class of these C*-algebras---what Bratteli called AF algebras---is closed under passing to extensions (a result that uses the Bott periodicity feature of K-theory). Students will be encouraged to prepare oral or written reports on various subjects related to the course, including basic theory and applications.", "division": "Faculty of Arts and Science", "department": "Mathematics", "prerequisites": "5.0 FCE from MAT, including MAT224H1/MAT247H1 and MAT237Y1/MAT257Y1.", "exclusions": "", "level": 400, "campus": "UTSG", "term": "2020 Winter", "breadths": [5], "meeting_sections": [{"code": "L0101", "instructors": ["G Elliott"], "times": [{"day": "MONDAY", "start": 50400, "end": 54000, "duration": 3600, "location": "HU 1018"}, {"day": "WEDNESDAY", "start": 50400, "end": 54000, "duration": 3600, "location": "HU 1018"}, {"day": "FRIDAY", "start": 50400, "end": 54000, "duration": 3600, "location": "HU 1018"}], "size": 15, "enrolment": 12}]}